function ITank_LoadSets(addSets, addRange)
    -- T1 (8件套) - 时光服 P1，熔火之心 Molten Core
    addRange(1991, 2009, 8)
    -- T5 (5件套) - 时光服 P2，风暴要塞 The Eye / 毒蛇神殿 SSC
    addSets({622, 627, 628, 629, 634, 635, 636, 641, 642, 643, 646, 649, 652, 656, 657, 665, 666, 2011, 2012}, 5)
    -- T4 (5件套) - 时光服 P7，卡拉赞 Karazhan / 格鲁尔的巢穴 Gruul / 玛瑟里顿的巢穴 Magtheridon
    addSets({621, 624, 625, 626, 631, 632, 633, 638, 639, 640, 645, 648, 651, 654, 655, 663, 664}, 5)
    -- T6 (5件套) - 时光服 P11：海加尔山之战 MH / 黑暗神庙 BT；
    addRange(668, 684, 5)
    -- T6.5 (3件套) - 时光服 P8，太阳井高地 Sunwell Plateau (腰带、护腕、鞋三件套)
    addSets({2031, 2032, 2033, 2034, 2035, 2036, 2037, 2038, 2041, 2042, 2043, 2044, 2045, 2046, 2047, 2048, 2049}, 3)
    -- T7 (5件套) - 时光服 P3，纳克萨玛斯 Naxxramas / 永恒之眼 EoE / 黑曜石圣殿 OS
    addRange(787, 805, 5)
    -- T8 (5件套) - 时光服 P6，奥杜尔 Ulduar
    addRange(820, 837, 5)
    -- T9 (5件套) - 时光服 P4，大十字军的试炼 ToC / 祖尔格拉布 ZG
    addSets({843, 846, 847, 849, 851, 853, 855, 857, 859, 861, 864, 865, 867, 869, 871, 873, 875, 877, 879}, 5)
    -- T10 (5件套) - 时光服 P10，冰冠堡垒 ICC / 红玉圣殿 RS
    addSets({883, 884, 885, 886, 887, 888, 889, 890, 891, 892, 893, 894, 895, 896, 897, 898, 899, 980, 901}, 5)
    -- T2.5 (5件套) - 时光服 P9，安其拉神殿 AQ40
    addSets({496, 505, 509, 501, 493, 497, 499, 503}, 5)
end

